god233012yamil/ESP32-IoT-Projects/ESP32C6 Touch LCD 1.47 SMNT Demo/sdkconfig.defaults
# Target configuration
CONFIG_IDF_TARGET="esp32c6"

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# SPI Configuration
CONFIG_SPI_MASTER_IN_IRAM=y

# WiFi Configuration
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=32
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=y
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=y

# LWIP Configuration
CONFIG_LWIP_MAX_SOCKETS=10
CONFIG_LWIP_SO_REUSE=y
CONFIG_LWIP_SO_RCVBUF=y

# SNTP Configuration
CONFIG_LWIP_SNTP_UPDATE_DELAY=3600000

# CPU Configuration
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_160=y

# Log Configuration
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
